---
kind: property
id: P:Autodesk.Revit.DB.Electrical.TemperatureRatingType.WireSizes
source: html/e3774ff7-1914-815d-8611-abb1c3174021.htm
---
# Autodesk.Revit.DB.Electrical.TemperatureRatingType.WireSizes Property

Get all electrical wire sizes defined in this temperature rating type and its corresponding material type.

## Syntax (C#)
```csharp
public WireSizeSet WireSizes { get; }
```